some little edition regarding ECU1
